In [106]:
import category_encoders as ce
import pandas as pd

In [107]:
col1 = ['Mahmoud', 'Sayed', 'Mahmoud', 'Mahmoud', 'Sayed']
col2 = [100,        1000,   200,        300,        1200]

dict_ = {
    'Name': col1,
    'Salary': col2
}

col3 = ['Khaled','Mahmoud', 'Sayed']
col4 = [10,         100, 1000]
dict_2 = {
    'Name':col3,
    'Salary': col4
}
ds = pd.DataFrame(dict_)
ds2 = pd.DataFrame(dict_2)

In [108]:
ds.head()

      Name  Salary
0  Mahmoud     100
1    Sayed    1000
2  Mahmoud     200
3  Mahmoud     300
4    Sayed    1200

In [109]:
TE = ce.TargetEncoder(smoothing=-2, )
TE.fit(X=ds['Name'], y=ds['Salary'])
ds['Name'] = TE.transform(X=ds['Name'], y=ds['Salary'])
ds2['Name'] = TE.transform(X=ds2['Name'], y=ds2['Salary'])

In [110]:
ds.head()

          Name  Salary
0   200.073234     100
1  1099.933367    1000
2   200.073234     200
3   200.073234     300
4  1099.933367    1200

In [111]:
ds2.head()

          Name  Salary
0   560.000000      10
1   200.073234     100
2  1099.933367    1000